# MemberDifference Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssemblyDifferenceMemberDifference..::..MemberDifference Property
AssemblyDifferenceMemberDifference Class See Also
---
Difference between the assembly members
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public AssemblyMemberDifference MemberDifference { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MemberDifference As AssemblyMemberDifference
	Get
```

Visual C++
---
```text
public:
property AssemblyMemberDifference^ MemberDifference {
	AssemblyMemberDifference^ get ();
}
```

# See Also
AssemblyDifferenceMemberDifference Class
Autodesk.Revit.DB Namespace